WillianWang2023/PMSM_Control/2_Simulink/work/iPMSM_F28069M_ert_rtw/iPMSM_F28069M.h
/*
 * Academic License - for use in teaching, academic research, and meeting
 * course requirements at degree granting institutions only.  Not for
 * government, commercial, or other organizational use.
 *
 * File: iPMSM_F28069M.h
 *
 * Code generated for Simulink model 'iPMSM_F28069M'.
 *
 * Model version                  : 6.14
 * Simulink Coder version         : 9.9 (R2023a) 19-Nov-2022
 * C/C++ source code generated on : Wed Jun  7 10:02:56 2023
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: Texas Instruments->C2000
 * Code generation objectives: Unspecified
 * Validation result: Not run
 */

#ifndef RTW_HEADER_iPMSM_F28069M_h_
#define RTW_HEADER_iPMSM_F28069M_h_
#ifndef iPMSM_F28069M_COMMON_INCLUDES_
#define iPMSM_F28069M_COMMON_INCLUDES_
#include "rtwtypes.h"
#include "c2000BoardSupport.h"
#include "F2806x_Device.h"
#include "F2806x_Gpio.h"
#include "DSP28xx_SciUtil.h"
#include "F2806x_Examples.h"
#include "IQmathLib.h"
#include "MW_SPI.h"
#endif                                 /* iPMSM_F28069M_COMMON_INCLUDES_ */

#include "MW_c2000ISR.h"
#include "iPMSM_F28069M_types.h"
#include <string.h>
#include "rt_nonfinite.h"
#include <stddef.h>
#include "zero_crossing_types.h"
#include "MW_target_hardware_resources.h"

/* Macros for accessing real-time model data structure */
#ifndef rtmGetErrorStatus
#define rtmGetErrorStatus(rtm)         ((rtm)->errorStatus)
#endif

#ifndef rtmSetErrorStatus
#define rtmSetErrorStatus(rtm, val)    ((rtm)->errorStatus = (val))
#endif

#ifndef rtmStepTask
#define rtmStepTask(rtm, idx)          ((rtm)->Timing.TaskCounters.TID[(idx)] == 0)
#endif

#ifndef rtmTaskCounter
#define rtmTaskCounter(rtm, idx)       ((rtm)->Timing.TaskCounters.TID[(idx)])
#endif

extern void init_SCI(void);
extern void init_SCI_GPIO(void);
extern void config_ePWM_GPIO (void);
extern void config_ePWM_TBSync (void);
extern void config_ePWM_XBAR(void);

/* Block signals for system '<S142>/Accumulate' */
typedef struct {
  real32_T Add;                        /* '<S143>/Add' */
  real32_T DataTypeConversion1;        /* '<S143>/Data Type Conversion1' */
  real32_T Add1;                       /* '<S143>/Add1' */
  real32_T Input;                      /* '<S144>/Input' */
  int16_T DataTypeConversion;          /* '<S143>/Data Type Conversion' */
  boolean_T Delay;                     /* '<S143>/Delay' */
} rtB_Accumulate_iPMSM_F28069M;

/* Block states (default storage) for system '<S142>/Accumulate' */
typedef struct {
  boolean_T Delay_DSTATE;              /* '<S143>/Delay' */
} rtDW_Accumulate_iPMSM_F28069M;

/* Block signals for system '<S147>/If Action Subsystem' */
typedef struct {
  real32_T Convert_back;               /* '<S149>/Convert_back' */
  int16_T Convert_uint16;              /* '<S149>/Convert_uint16' */
} rtB_IfActionSubsystem_iPMSM_F28;

/* Block signals for system '<S147>/If Action Subsystem1' */
typedef struct {
  real32_T Convert_back;               /* '<S150>/Convert_back' */
  int16_T Convert_uint16;              /* '<S150>/Convert_uint16' */
} rtB_IfActionSubsystem1_iPMSM_F2;

/* Block signals for system '<S338>/Dir_Sense' */
typedef struct {
  int16_T Switch;                      /* '<S346>/Switch' */
  boolean_T LogicalOperator;           /* '<S346>/Logical Operator' */
} rtB_Dir_Sense_iPMSM_F28069M;

/* Zero-crossing (trigger) state for system '<S338>/Dir_Sense' */
typedef struct {
  ZCSigState Dir_Sense_Trig_ZCE;       /* '<S338>/Dir_Sense' */
} rtZCE_Dir_Sense_iPMSM_F28069M;

/* Block signals for system '<S377>/SPI Master Transfer' */
typedef struct {
  uint16_T SPIMasterTransfer;          /* '<S377>/SPI Master Transfer' */
} rtB_SPIMasterTransfer_iPMSM_F28;

/* Block states (default storage) for system '<S377>/SPI Master Transfer' */
typedef struct {
  codertarget_tic2000_blocks_SPIM obj; /* '<S377>/SPI Master Transfer' */
  boolean_T objisempty;                /* '<S377>/SPI Master Transfer' */
} rtDW_SPIMasterTransfer_iPMSM_F2;

/* Block signals for system '<Root>/Speed Control' */
typedef struct {
  real32_T Id_Ref;                     /* '<S7>/Id_Ref' */
  real32_T RateLimiter;                /* '<S392>/Rate Limiter' */
  real32_T RateLimiter1;               /* '<S392>/Rate Limiter1' */
  real32_T Speed_Ref;                  /* '<S393>/Switch' */
  real32_T Product;                    /* '<S448>/Product' */
  real32_T UnitDelay;                  /* '<S448>/Unit Delay' */
  real32_T Product1;                   /* '<S448>/Product1' */
  real32_T Add1;                       /* '<S448>/Add1' */
  real32_T Sum;                        /* '<S391>/Sum' */
  real32_T PProdOut;                   /* '<S434>/PProd Out' */
  real32_T Ki2;                        /* '<S391>/Ki2' */
  real32_T Integrator;                 /* '<S429>/Integrator' */
  real32_T Sum_g;                      /* '<S438>/Sum' */
  real32_T DeadZone;                   /* '<S422>/DeadZone' */
  real32_T IProdOut;                   /* '<S426>/IProd Out' */
  real32_T Switch;                     /* '<S420>/Switch' */
  real32_T Saturation;                 /* '<S436>/Saturation' */
  real32_T DataStoreRead;              /* '<S393>/Data Store Read' */
  real32_T Switch1;                    /* '<S393>/Switch1' */
  real32_T Switch_a;                   /* '<S392>/Switch' */
  int16_T Switch1_c;                   /* '<S420>/Switch1' */
  int16_T Switch2;                     /* '<S420>/Switch2' */
  boolean_T DataStoreRead1;            /* '<S391>/Data Store Read1' */
  boolean_T DataStoreRead2;            /* '<S391>/Data Store Read2' */
  boolean_T AND;                       /* '<S391>/AND' */
  boolean_T DataStoreRead1_p;          /* '<S393>/Data Store Read1' */
  boolean_T LogicalOperator;           /* '<S391>/Logical Operator' */
  boolean_T RelationalOperator;        /* '<S420>/Relational Operator' */
  boolean_T fixforDTpropagationissue;/* '<S420>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1;
                                    /* '<S420>/fix for DT propagation issue1' */
  boolean_T Equal1;                    /* '<S420>/Equal1' */
  boolean_T AND3;                      /* '<S420>/AND3' */
} rtB_SpeedControl_iPMSM_F28069M;

