WillianWang2023/PMSM_Control/2_Simulink/work/iPMSM_F28069M_ert_rtw/iPMSM_F28069M.h
/* Block states (default storage) for system '<Root>/Speed Control' */
typedef struct {
  real32_T UnitDelay_DSTATE;           /* '<S448>/Unit Delay' */
  real32_T Integrator_DSTATE;          /* '<S429>/Integrator' */
  real32_T PrevY;                      /* '<S392>/Rate Limiter' */
  real32_T PrevY_f;                    /* '<S392>/Rate Limiter1' */
  int16_T Integrator_PrevResetState;   /* '<S429>/Integrator' */
} rtDW_SpeedControl_iPMSM_F28069M;

/* Block signals (default storage) */
typedef struct {
  uint32_T Sum[4];                     /* '<S20>/Sum' */
  uint32_T Sum_d[4];                   /* '<S197>/Sum' */
  uint32_T PositionToCount;            /* '<S307>/PositionToCount' */
  uint32_T Delay;                      /* '<S307>/Delay' */
  uint32_T PositionToCount_i;          /* '<S344>/PositionToCount' */
  uint32_T Delay_l;                    /* '<S344>/Delay' */
  real32_T RT6;                        /* '<Root>/RT6' */
  real32_T RT4;                        /* '<Root>/RT4' */
  real32_T RT2[2];                     /* '<Root>/RT2' */
  real32_T DataTypeConversion1[2];     /* '<S388>/Data Type Conversion1' */
  real32_T Speed_Ref;                  /* '<S6>/Data Type Conversion1' */
  real32_T DataStoreRead;              /* '<S18>/Data Store Read' */
  real32_T Abs;                        /* '<S18>/Abs' */
  real32_T Gain;                       /* '<S18>/Gain' */
  real32_T UnitDelay;                  /* '<S142>/Unit Delay' */
  real32_T Delay5[4];                  /* '<S1>/Delay5' */
  real32_T Switch;                     /* '<S18>/Switch' */
  real32_T Merge;                      /* '<S147>/Merge' */
  real32_T indexing;                   /* '<S20>/indexing' */
  real32_T Lookup[4];                  /* '<S20>/Lookup' */
  real32_T Sum3;                       /* '<S146>/Sum3' */
  real32_T DataTypeConversion1_m;      /* '<S20>/Data Type Conversion1' */
  real32_T Sum2;                       /* '<S20>/Sum2' */
  real32_T Product;                    /* '<S146>/Product' */
  real32_T Sum4;                       /* '<S146>/Sum4' */
  real32_T Sum5;                       /* '<S146>/Sum5' */
  real32_T Product1;                   /* '<S146>/Product1' */
  real32_T Sum6;                       /* '<S146>/Sum6' */
  real32_T Sum_m;                      /* '<S24>/Sum' */
  real32_T PProdOut;                   /* '<S129>/PProd Out' */
  real32_T UnitDelay_p;                /* '<S24>/Unit Delay' */
  real32_T Integrator;                 /* '<S124>/Integrator' */
  real32_T Sum_a;                      /* '<S133>/Sum' */
  real32_T Switch_j;                   /* '<S24>/Switch' */
  real32_T Sum_g;                      /* '<S23>/Sum' */
  real32_T PProdOut_c;                 /* '<S78>/PProd Out' */
  real32_T UnitDelay_i;                /* '<S23>/Unit Delay' */
  real32_T Integrator_i;               /* '<S73>/Integrator' */
  real32_T Sum_n;                      /* '<S82>/Sum' */
  real32_T Switch_d;                   /* '<S23>/Switch' */
  real32_T Switch_jv;                  /* '<S27>/Switch' */
  real32_T Product_l;                  /* '<S27>/Product' */
  real32_T Product_o;                  /* '<S28>/Product' */
  real32_T Product1_a;                 /* '<S28>/Product1' */
  real32_T Sum1;                       /* '<S28>/Sum1' */
  real32_T Merge_m[2];                 /* '<S22>/Merge' */
  real32_T DeadZone;                   /* '<S66>/DeadZone' */
  real32_T IProdOut;                   /* '<S70>/IProd Out' */
  real32_T Switch_o;                   /* '<S64>/Switch' */
  real32_T DeadZone_n;                 /* '<S117>/DeadZone' */
  real32_T IProdOut_n;                 /* '<S121>/IProd Out' */
  real32_T Switch_l;                   /* '<S115>/Switch' */
  real32_T DataTypeConversion;         /* '<S13>/Data Type Conversion' */
  real32_T Speed_fb_PU;                /* '<S1>/Input Scaling' */
  real32_T TmpSignalConversionAtDelay5Inpo[4];
  real32_T sqrt3_by_two;               /* '<S156>/sqrt3_by_two' */
  real32_T one_by_two;                 /* '<S156>/one_by_two' */
  real32_T add_c;                      /* '<S156>/add_c' */
  real32_T add_b;                      /* '<S156>/add_b' */
  real32_T Min;                        /* '<S154>/Min' */
  real32_T Max;                        /* '<S154>/Max' */
  real32_T Add;                        /* '<S154>/Add' */
  real32_T one_by_two_d;               /* '<S154>/one_by_two' */
  real32_T Add3;                       /* '<S153>/Add3' */
  real32_T Add2;                       /* '<S153>/Add2' */
  real32_T Add1;                       /* '<S153>/Add1' */
  real32_T Gain_c[3];                  /* '<S153>/Gain' */
  real32_T Gain_c1[3];                 /* '<S13>/Gain' */
  real32_T PWM_Duty_Cycles[3];         /* '<S13>/Sum' */
  real32_T Merge_k[2];                 /* '<S166>/Merge' */
  real32_T Delay1;                     /* '<S170>/Delay1' */
  real32_T Delay_f[2];                 /* '<S171>/Delay' */
  real32_T Gain_m;                     /* '<S176>/Gain' */
  real32_T UnaryMinus;                 /* '<S184>/Unary Minus' */
  real32_T Product1_f;                 /* '<S173>/Product1' */
  real32_T Gain1;                      /* '<S183>/Gain1' */
  real32_T Product2;                   /* '<S184>/Product2' */
  real32_T Product_k;                  /* '<S173>/Product' */
  real32_T Gain_n;                     /* '<S183>/Gain' */
  real32_T Product_i;                  /* '<S184>/Product' */
  real32_T Sum_mr;                     /* '<S184>/Sum' */
  real32_T Product1_ao;                /* '<S184>/Product1' */
  real32_T Product3;                   /* '<S184>/Product3' */
  real32_T Sum1_m;                     /* '<S184>/Sum1' */
  real32_T Product3_n;                 /* '<S173>/Product3' */
  real32_T Product1_o;                 /* '<S180>/Product1' */
  real32_T Product2_c;                 /* '<S173>/Product2' */
  real32_T Gain_g;                     /* '<S175>/Gain' */
  real32_T Product3_n0;                /* '<S180>/Product3' */
  real32_T Sum1_c;                     /* '<S180>/Sum1' */
  real32_T Product1_h;                 /* '<S179>/Product1' */
  real32_T UnaryMinus_k;               /* '<S179>/Unary Minus' */
  real32_T UnaryMinus_f;               /* '<S180>/Unary Minus' */
  real32_T Product2_a;                 /* '<S180>/Product2' */
  real32_T Product_g;                  /* '<S180>/Product' */
  real32_T Sum_i;                      /* '<S180>/Sum' */
  real32_T Product_kc;                 /* '<S179>/Product' */
  real32_T UnaryMinus_fm;              /* '<S181>/Unary Minus' */
  real32_T Gain1_o;                    /* '<S178>/Gain1' */
  real32_T UnaryMinus1;                /* '<S178>/Unary Minus1' */
  real32_T Product2_d;                 /* '<S181>/Product2' */
  real32_T Gain_j;                     /* '<S178>/Gain' */
  real32_T UnaryMinus_i;               /* '<S178>/Unary Minus' */
  real32_T Product_f;                  /* '<S181>/Product' */
  real32_T Sum_e;                      /* '<S181>/Sum' */
  real32_T Product1_oz;                /* '<S181>/Product1' */
  real32_T Product3_nb;                /* '<S181>/Product3' */
  real32_T Sum1_k;                     /* '<S181>/Sum1' */
  real32_T UnaryMinus_j;               /* '<S182>/Unary Minus' */
  real32_T Product_n;                  /* '<S177>/Product' */
  real32_T Product3_c;                 /* '<S177>/Product3' */
  real32_T UnaryMinus1_b;              /* '<S177>/Unary Minus1' */
  real32_T Product5;                   /* '<S177>/Product5' */
  real32_T Sum1_i;                     /* '<S177>/Sum1' */
  real32_T Product2_o;                 /* '<S182>/Product2' */
  real32_T Product4;                   /* '<S177>/Product4' */
  real32_T Product1_b;                 /* '<S177>/Product1' */
  real32_T UnaryMinus_g;               /* '<S177>/Unary Minus' */
  real32_T Product2_f;                 /* '<S177>/Product2' */
  real32_T Sum_k;                      /* '<S177>/Sum' */
  real32_T Product_gf;                 /* '<S182>/Product' */
  real32_T Sum_h;                      /* '<S182>/Sum' */
  real32_T Product1_d;                 /* '<S182>/Product1' */
  real32_T Product3_g;                 /* '<S182>/Product3' */
  real32_T Sum1_j;                     /* '<S182>/Sum1' */
  real32_T Sum_l[2];                   /* '<S175>/Sum' */
  real32_T Sum_n2[2];                  /* '<S171>/Sum' */
  real32_T Gain1_c[2];                 /* '<S171>/Gain1' */
  real32_T Sum2_o[2];                  /* '<S171>/Sum2' */
  real32_T Gain2[2];                   /* '<S171>/Gain2' */
  real32_T Sum1_j4[2];                 /* '<S171>/Sum1' */
  real32_T Product_m[2];               /* '<S170>/Product' */
  real32_T Product_j[2];               /* '<S187>/Product' */
  real32_T UnitDelay_j[2];             /* '<S187>/Unit Delay' */
  real32_T Product1_e[2];              /* '<S187>/Product1' */
  real32_T Add1_j[2];                  /* '<S187>/Add1' */
  real32_T Delay_e;                    /* '<S189>/Delay' */
  real32_T Merge_h;                    /* '<S253>/Merge' */
  real32_T indexing_j;                 /* '<S197>/indexing' */
  real32_T Lookup_i[4];                /* '<S197>/Lookup' */
  real32_T Sum5_o;                     /* '<S252>/Sum5' */
  real32_T DataTypeConversion1_ma;     /* '<S197>/Data Type Conversion1' */
  real32_T Sum2_c;                     /* '<S197>/Sum2' */
  real32_T Product1_k;                 /* '<S252>/Product1' */
  real32_T Sum6_a;                     /* '<S252>/Sum6' */
  real32_T Merge_k4;                   /* '<S188>/Merge' */
  real32_T Square;                     /* '<S194>/Square' */
  real32_T Merge1;                     /* '<S188>/Merge1' */
  real32_T Square1;                    /* '<S194>/Square1' */
  real32_T Sum_e2;                     /* '<S194>/Sum' */
  real32_T Sqrt;                       /* '<S194>/Sqrt' */
  real32_T Switch_b;                   /* '<S194>/Switch' */
  real32_T Divide1;                    /* '<S194>/Divide1' */
  real32_T Product_la;                 /* '<S189>/Product' */
  real32_T Divide;                     /* '<S194>/Divide' */
  real32_T Sum3_m;                     /* '<S252>/Sum3' */
  real32_T Product_ig;                 /* '<S252>/Product' */
  real32_T Sum4_j;                     /* '<S252>/Sum4' */
  real32_T Product1_dd;                /* '<S189>/Product1' */
  real32_T Sum_b;                      /* '<S189>/Sum' */
  real32_T ProportionalGain;           /* '<S238>/Proportional Gain' */
  real32_T IntegralGain;               /* '<S230>/Integral Gain' */
  real32_T Integrator_c;               /* '<S233>/Integrator' */
  real32_T Sum_dd;                     /* '<S242>/Sum' */
  real32_T Merge_g;                    /* '<S198>/Merge' */
  real32_T Product_kr;                 /* '<S283>/Product' */
  real32_T UnitDelay_l;                /* '<S283>/Unit Delay' */
  real32_T Product1_ff;                /* '<S283>/Product1' */
  real32_T Add1_d;                     /* '<S283>/Add1' */
  real32_T speed;                      /* '<S189>/Sum1' */
  real32_T Gain_i;                     /* '<S189>/Gain' */
  real32_T UnitDelay_b;                /* '<S196>/Unit Delay' */
  real32_T Product_iq;                 /* '<S201>/Product' */
  real32_T UnitDelay_im;               /* '<S201>/Unit Delay' */
  real32_T Product1_ok;                /* '<S201>/Product1' */
  real32_T Add1_h;                     /* '<S201>/Add1' */
  real32_T Delay2;                     /* '<S294>/Delay2' */
  real32_T Delay3;                     /* '<S294>/Delay3' */
  real32_T Product_oq;                 /* '<S303>/Product' */
  real32_T UnitDelay_n;                /* '<S303>/Unit Delay' */
  real32_T Product1_n;                 /* '<S303>/Product1' */
  real32_T Add1_a;                     /* '<S303>/Add1' */
  real32_T Gain_h;                     /* '<S294>/Gain' */
  real32_T Sum1_cg;                    /* '<S294>/Sum1' */
  real32_T Gain1_a;                    /* '<S294>/Gain1' */
  real32_T Delay2_i;                   /* '<S295>/Delay2' */
  real32_T Delay3_n;                   /* '<S295>/Delay3' */
  real32_T Product_n1;                 /* '<S300>/Product' */
  real32_T UnitDelay_bs;               /* '<S300>/Unit Delay' */
  real32_T Product1_o1;                /* '<S300>/Product1' */
  real32_T Add1_p;                     /* '<S300>/Add1' */
  real32_T Gain_is;                    /* '<S295>/Gain' */
  real32_T Sum1_a;                     /* '<S295>/Sum1' */
  real32_T Gain1_j;                    /* '<S295>/Gain1' */
  real32_T Product_e;                  /* '<S260>/Product' */
  real32_T Product1_fq;                /* '<S260>/Product1' */
  real32_T Product_ky;                 /* '<S293>/Product' */
  real32_T UnitDelay_l2;               /* '<S293>/Unit Delay' */
  real32_T Product1_dp;                /* '<S293>/Product1' */
  real32_T Add1_au;                    /* '<S293>/Add1' */
  real32_T Delay1_f;                   /* '<S286>/Delay1' */
  real32_T Sum_ad;                     /* '<S286>/Sum' */
  real32_T Gain1_f;                    /* '<S286>/Gain1' */
  real32_T Delay_a;                    /* '<S286>/Delay' */
  real32_T Gain2_f;                    /* '<S286>/Gain2' */
  real32_T Sum1_p;                     /* '<S286>/Sum1' */
  real32_T Product_d;                  /* '<S259>/Product' */
  real32_T Product_a;                  /* '<S290>/Product' */
  real32_T UnitDelay_o;                /* '<S290>/Unit Delay' */
  real32_T Product1_m;                 /* '<S290>/Product1' */
  real32_T Add1_jc;                    /* '<S290>/Add1' */
  real32_T Delay1_g;                   /* '<S287>/Delay1' */
  real32_T Sum_ia;                     /* '<S287>/Sum' */
  real32_T Gain1_ok;                   /* '<S287>/Gain1' */
  real32_T Delay_b;                    /* '<S287>/Delay' */
  real32_T Gain2_c;                    /* '<S287>/Gain2' */
  real32_T Sum1_il;                    /* '<S287>/Sum1' */
  real32_T Product1_j;                 /* '<S259>/Product1' */
  real32_T Sum_ie;                     /* '<S259>/Sum' */
  real32_T MathFunction;               /* '<S259>/Math Function' */
  real32_T Abs_p;                      /* '<S259>/Abs' */
  real32_T Delay2_n;                   /* '<S261>/Delay2' */
  real32_T Delay3_ni;                  /* '<S261>/Delay3' */
  real32_T Product_p;                  /* '<S275>/Product' */
  real32_T UnitDelay_c;                /* '<S275>/Unit Delay' */
  real32_T Product1_c;                 /* '<S275>/Product1' */
  real32_T Add1_f;                     /* '<S275>/Add1' */
  real32_T Gain_d;                     /* '<S261>/Gain' */
  real32_T Sum1_jp;                    /* '<S261>/Sum1' */
  real32_T Gain1_i;                    /* '<S261>/Gain1' */
  real32_T Delay2_d;                   /* '<S262>/Delay2' */
  real32_T Delay3_h;                   /* '<S262>/Delay3' */
  real32_T Product_pv;                 /* '<S269>/Product' */
  real32_T UnitDelay_i1;               /* '<S269>/Unit Delay' */
  real32_T Product1_o5;                /* '<S269>/Product1' */
  real32_T Add1_o;                     /* '<S269>/Add1' */
  real32_T Gain_jy;                    /* '<S262>/Gain' */
  real32_T Sum1_l;                     /* '<S262>/Sum1' */
  real32_T Gain1_e;                    /* '<S262>/Gain1' */
  real32_T Delay_e4;                   /* '<S266>/Delay' */
  real32_T Delay1_h;                   /* '<S266>/Delay1' */
  real32_T Switch1;                    /* '<S266>/Switch1' */
  real32_T Product_c;                  /* '<S272>/Product' */
  real32_T UnitDelay_jq;               /* '<S272>/Unit Delay' */
  real32_T Product1_dx;                /* '<S272>/Product1' */
  real32_T Add1_i;                     /* '<S272>/Add1' */
  real32_T Square_f;                   /* '<S257>/Square' */
  real32_T Square1_i;                  /* '<S257>/Square1' */
  real32_T Sum2_oo;                    /* '<S257>/Sum2' */
  real32_T Sqrt_n;                     /* '<S257>/Sqrt' */
  real32_T UnaryMinus_h;               /* '<S257>/Unary Minus' */
  real32_T Sum_j;                      /* '<S266>/Sum' */
  real32_T Product_ds[4];              /* '<S311>/Product' */
  real32_T UnitDelay_g[4];             /* '<S311>/Unit Delay' */
  real32_T Product1_fg[4];             /* '<S311>/Product1' */
  real32_T Add1_iq[4];                 /* '<S311>/Add1' */
  real32_T Sum6_ap[4];                 /* '<S304>/Sum6' */
  real32_T ScalingR;                   /* '<S328>/ScalingR' */
  real32_T Sum3_d;                     /* '<S325>/Sum3' */
  real32_T Delay1_c;                   /* '<S327>/Delay1' */
  real32_T Sum_nc;                     /* '<S327>/Sum' */
  real32_T Gain1_m;                    /* '<S327>/Gain1' */
  real32_T Delay_ld;                   /* '<S327>/Delay' */
  real32_T Gain2_j;                    /* '<S327>/Gain2' */
  real32_T Sum1_n;                     /* '<S327>/Sum1' */
  real32_T ScalingL;                   /* '<S328>/ScalingL' */
  real32_T Sum1_b;                     /* '<S325>/Sum1' */
  real32_T Product_iy;                 /* '<S331>/Product' */
  real32_T UnitDelay_ii;               /* '<S331>/Unit Delay' */
  real32_T Product1_b3;                /* '<S331>/Product1' */
  real32_T Add1_o0;                    /* '<S331>/Add1' */
  real32_T Switch_g;                   /* '<S325>/Switch' */
  real32_T ScalingR_k;                 /* '<S321>/ScalingR' */
  real32_T Sum3_n;                     /* '<S318>/Sum3' */
  real32_T Delay1_o;                   /* '<S320>/Delay1' */
  real32_T Sum_lg;                     /* '<S320>/Sum' */
  real32_T Gain1_ox;                   /* '<S320>/Gain1' */
  real32_T Delay_h;                    /* '<S320>/Delay' */
  real32_T Gain2_f1;                   /* '<S320>/Gain2' */
  real32_T Sum1_ni;                    /* '<S320>/Sum1' */
  real32_T ScalingL_c;                 /* '<S321>/ScalingL' */
  real32_T Sum1_g;                     /* '<S318>/Sum1' */
  real32_T Product_m5;                 /* '<S324>/Product' */
  real32_T UnitDelay_f;                /* '<S324>/Unit Delay' */
  real32_T Product1_hg;                /* '<S324>/Product1' */
  real32_T Add1_az;                    /* '<S324>/Add1' */
  real32_T Switch_h;                   /* '<S318>/Switch' */
  real32_T DTC;                        /* '<S336>/DTC' */
  real32_T SpeedGain;                  /* '<S307>/SpeedGain' */
  real32_T Product_pk;                 /* '<S334>/Product' */
  real32_T UnitDelay_d;                /* '<S334>/Unit Delay' */
  real32_T Product1_al;                /* '<S334>/Product1' */
  real32_T Add1_pz;                    /* '<S334>/Add1' */
  real32_T elect2mech;                 /* '<S168>/elect2mech' */
  real32_T Sum_f;                      /* '<S330>/Sum' */
  real32_T Sum_bp;                     /* '<S323>/Sum' */
  real32_T Atan2;                      /* '<S316>/Atan2' */
  real32_T Switch_ds;                  /* '<S316>/Switch' */
  real32_T algDD;
  real32_T Gain_f;                     /* '<S317>/Gain' */
  real32_T Switch_c;                   /* '<S317>/Switch' */
  real32_T Bias;                       /* '<S317>/Bias' */
  real32_T UnitDelay1;                 /* '<S349>/Unit Delay1' */
  real32_T UnitDelay_g4;               /* '<S349>/Unit Delay' */
  real32_T a;                          /* '<S349>/a' */
  real32_T Delay_k;                    /* '<S339>/Delay' */
  real32_T Sum2_g;                     /* '<S339>/Sum2' */
  real32_T Sum3_md;                    /* '<S349>/Sum3' */
  real32_T b_invg;                     /* '<S349>/b_inv*g' */
  real32_T Delay1_e;                   /* '<S349>/Delay1' */
  real32_T Sum4_b;                     /* '<S349>/Sum4' */
  real32_T Product_c0;                 /* '<S353>/Product' */
  real32_T UnitDelay_a;                /* '<S353>/Unit Delay' */
  real32_T Product1_en;                /* '<S353>/Product1' */
  real32_T Add1_dd;                    /* '<S353>/Add1' */
  real32_T UnitDelay1_k;               /* '<S350>/Unit Delay1' */
  real32_T UnitDelay_k;                /* '<S350>/Unit Delay' */
  real32_T a_e;                        /* '<S350>/a' */
  real32_T Delay_i;                    /* '<S340>/Delay' */
  real32_T Sum2_g2;                    /* '<S340>/Sum2' */
  real32_T Sum3_l;                     /* '<S350>/Sum3' */
  real32_T b_invg_o;                   /* '<S350>/b_inv*g' */
  real32_T Delay1_fr;                  /* '<S350>/Delay1' */
  real32_T Sum4_m;                     /* '<S350>/Sum4' */
  real32_T Product_p3;                 /* '<S356>/Product' */
  real32_T UnitDelay_gx;               /* '<S356>/Unit Delay' */
  real32_T Product1_k4;                /* '<S356>/Product1' */
  real32_T Add1_g;                     /* '<S356>/Add1' */
  real32_T Merge_ku;                   /* '<S338>/Merge' */
  real32_T Merge1_i;                   /* '<S338>/Merge1' */
  real32_T Delay_ep;                   /* '<S337>/Delay' */
  real32_T Sign;                       /* '<S339>/Sign' */
  real32_T Eta;                        /* '<S339>/Eta' */
  real32_T Sum_gf;                     /* '<S339>/Sum' */
  real32_T b;                          /* '<S339>/b' */
  real32_T a_a;                        /* '<S339>/a' */
  real32_T Sum1_d;                     /* '<S339>/Sum1' */
  real32_T Sign_m;                     /* '<S340>/Sign' */
  real32_T Eta_n;                      /* '<S340>/Eta' */
  real32_T Sum_bl;                     /* '<S340>/Sum' */
  real32_T b_i;                        /* '<S340>/b' */
  real32_T a_p;                        /* '<S340>/a' */
  real32_T Sum1_gj;                    /* '<S340>/Sum1' */
  real32_T DTC_e;                      /* '<S361>/DTC' */
  real32_T SpeedGain_k;                /* '<S344>/SpeedGain' */
  real32_T Product_i2;                 /* '<S359>/Product' */
  real32_T UnitDelay_ci;               /* '<S359>/Unit Delay' */
  real32_T Product1_ey;                /* '<S359>/Product1' */
  real32_T Add1_c;                     /* '<S359>/Add1' */
  real32_T Product_jt;                 /* '<S345>/Product' */
  real32_T Product2_i;                 /* '<S345>/Product2' */
  real32_T Sum1_mc;                    /* '<S345>/Sum1' */
  real32_T Product1_mw;                /* '<S345>/Product1' */
  real32_T Product3_b;                 /* '<S345>/Product3' */
  real32_T Sum2_p;                     /* '<S345>/Sum2' */
  real32_T Switch_cx;                  /* '<S345>/Switch' */
  real32_T Atan2_n;                    /* '<S362>/Atan2' */
  real32_T Switch_gb;                  /* '<S362>/Switch' */
  real32_T algDD_a;
  real32_T Gain_o;                     /* '<S363>/Gain' */
  real32_T Switch_m;                   /* '<S363>/Switch' */
  real32_T Bias_f;                     /* '<S363>/Bias' */
  real32_T Bias_j;                     /* '<S345>/Bias' */
  real32_T acos_c;                     /* '<S19>/acos' */
  real32_T bsin;                       /* '<S19>/bsin' */
  real32_T sum_Ds;                     /* '<S19>/sum_Ds' */
  real32_T bcos;                       /* '<S19>/bcos' */
  real32_T asin_f;                     /* '<S19>/asin' */
  real32_T sum_Qs;                     /* '<S19>/sum_Qs' */
  real32_T Switch_bi[2];               /* '<S145>/Switch' */
  real32_T algDD_o1;
  real32_T algDD_o2;
  real32_T qcos;                       /* '<S17>/qcos' */
  real32_T dsin;                       /* '<S17>/dsin' */
  real32_T sum_beta;                   /* '<S17>/sum_beta' */
  real32_T dcos;                       /* '<S17>/dcos' */
  real32_T qsin;                       /* '<S17>/qsin' */
  real32_T sum_alpha;                  /* '<S17>/sum_alpha' */
  real32_T Switch_df[2];               /* '<S141>/Switch' */
  real32_T algDD_o1_o;
  real32_T algDD_o2_c;
  real32_T Saturation;                 /* '<S131>/Saturation' */
  real32_T Vd_OpenLoop;                /* '<S23>/Vd_OpenLoop' */
  real32_T Abs_i;                      /* '<S23>/Abs' */
  real32_T Saturation_a;               /* '<S23>/Saturation' */
  real32_T Saturation_f;               /* '<S80>/Saturation' */
  real32_T Product_ch[2];              /* '<S29>/Product' */
