WillianWang2023/PMSM_Control/2_Simulink/work/iPMSM_F28069M_ert_rtw/iPMSM_F28069M.h
  real32_T SquareRoot;                 /* '<S29>/Square Root' */
  real32_T Switch_os;                  /* '<S29>/Switch' */
  real32_T Reciprocal;                 /* '<S29>/Reciprocal' */
  real32_T Switch_i[2];                /* '<S26>/Switch' */
  real32_T Switch2;                    /* '<S36>/Switch2' */
  real32_T Product_b;                  /* '<S35>/Product' */
  real32_T Sum_a3;                     /* '<S35>/Sum' */
  real32_T Product2_ao;                /* '<S35>/Product2' */
  real32_T Merge_e;                    /* '<S35>/Merge' */
  real32_T Gain_l;                     /* '<S35>/Gain' */
  real32_T Switch_k;                   /* '<S36>/Switch' */
  real32_T Switch1_h;                  /* '<S37>/Switch1' */
  real32_T Sqrt_np;                    /* '<S37>/Sqrt' */
  real32_T Gain_e;                     /* '<S37>/Gain' */
  real32_T a_plus_2b;                  /* '<S15>/a_plus_2b' */
  real32_T one_by_sqrt3;               /* '<S15>/one_by_sqrt3' */
  real32_T algDD_o1_g;
  real32_T algDD_o2_cx;
  int32_T DataTypeConversion_c[2];     /* '<S165>/Data Type Conversion' */
  int32_T Add_k[2];                    /* '<S165>/Add' */
  int32_T Q17perunitconversion[2];     /* '<S165>/Q17 per unit conversion' */
  int32_T SpeedCount;                  /* '<S307>/SpeedCount' */
  int32_T SpeedCount_c;                /* '<S344>/SpeedCount' */
  uint16_T Divide_h;                   /* '<S376>/Divide' */
  uint16_T Divide1_e;                  /* '<S376>/Divide1' */
  uint16_T ForIterator;                /* '<S379>/For Iterator' */
  uint16_T IAIBMeasurement[2];         /* '<S379>/IA//IB Measurement' */
  uint16_T Memory;                     /* '<S384>/Memory' */
  uint16_T Sum_dn;                     /* '<S384>/Sum' */
  uint16_T Memory1;                    /* '<S384>/Memory1' */
  uint16_T Sum1_dq;                    /* '<S384>/Sum1' */
  uint16_T SCIReceive[2];              /* '<S390>/SCI Receive' */
  uint16_T Switch2_m;                  /* '<S18>/Switch2' */
  uint16_T DataStoreRead_m;            /* '<S165>/Data Store Read' */
  uint16_T DataStoreRead1;             /* '<S165>/Data Store Read1' */
  uint16_T Switch1_f;                  /* '<S27>/Switch1' */
  uint16_T DataTypeConversion_a;       /* '<S147>/Data Type Conversion' */
  uint16_T Get_Integer;                /* '<S20>/Get_Integer' */
  uint16_T Output;                     /* '<S157>/Output' */
  uint16_T DataTypeConversion3[2];     /* '<S159>/Data Type Conversion3' */
  uint16_T SCI_Tx_Data[3];             /* '<S9>/Merge' */
  uint16_T SCI_Tx_Iteration;           /* '<S9>/Merge1' */
  uint16_T FixPtSum1;                  /* '<S162>/FixPt Sum1' */
  uint16_T FixPtSwitch;                /* '<S163>/FixPt Switch' */
  uint16_T Switch1_c[3];               /* '<S364>/Switch1' */
  uint16_T IndexVector;                /* '<S366>/Index Vector' */
  uint16_T Add_m;                      /* '<S366>/Add' */
  uint16_T Scale_to_PWM_Counter_PRD[3];/* '<S364>/Scale_to_PWM_Counter_PRD' */
  uint16_T DataTypeConversion_m;       /* '<S253>/Data Type Conversion' */
  uint16_T Get_Integer_c;              /* '<S197>/Get_Integer' */
  uint16_T Data[2];                    /* '<S158>/Data' */
  uint16_T Data_f[2];                  /* '<S160>/Data' */
  uint16_T Data_fw[2];                 /* '<S161>/Data' */
  uint16_T DataTypeConversion_k;       /* '<S25>/Data Type Conversion' */
  uint16_T DataTypeConversion_a4;      /* '<S35>/Data Type Conversion' */
  int16_T DataTypeConversion2[2];      /* '<S388>/Data Type Conversion2' */
  int16_T DataTypeConversion_l[2];     /* '<S159>/Data Type Conversion' */
  int16_T WhileIterator;               /* '<S366>/While Iterator' */
  int16_T Switch1_l;                   /* '<S64>/Switch1' */
  int16_T Switch2_i;                   /* '<S64>/Switch2' */
  int16_T Switch1_cm;                  /* '<S115>/Switch1' */
  int16_T Switch2_c;                   /* '<S115>/Switch2' */
  boolean_T NOT;                       /* '<S375>/NOT' */
  boolean_T DataTypeConversion3_b;     /* '<S6>/Data Type Conversion3' */
  boolean_T DataTypeConversion_j;      /* '<S18>/Data Type Conversion' */
  boolean_T NOT_a;                     /* '<S142>/NOT' */
  boolean_T Compare;                   /* '<S148>/Compare' */
  boolean_T DataStoreRead1_b;          /* '<S24>/Data Store Read1' */
  boolean_T LogicalOperator;           /* '<S24>/Logical Operator' */
  boolean_T DataStoreRead1_f;          /* '<S23>/Data Store Read1' */
  boolean_T LogicalOperator_e;         /* '<S23>/Logical Operator' */
  boolean_T RelationalOperator;        /* '<S64>/Relational Operator' */
  boolean_T fixforDTpropagationissue; /* '<S64>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1;
                                     /* '<S64>/fix for DT propagation issue1' */
  boolean_T Equal1;                    /* '<S64>/Equal1' */
  boolean_T AND3;                      /* '<S64>/AND3' */
  boolean_T RelationalOperator_i;      /* '<S115>/Relational Operator' */
  boolean_T fixforDTpropagationissue_f;
                                     /* '<S115>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1_g;
                                    /* '<S115>/fix for DT propagation issue1' */
  boolean_T Equal1_m;                  /* '<S115>/Equal1' */
  boolean_T AND3_d;                    /* '<S115>/AND3' */
  boolean_T Enable;                    /* '<S13>/Enable' */
  boolean_T DataStoreRead1_g;          /* '<S167>/Data Store Read1' */
  boolean_T LogicalOperator_l;         /* '<S167>/Logical Operator' */
  boolean_T Compare_l;                 /* '<S254>/Compare' */
  boolean_T AlphaRelay;                /* '<S188>/AlphaRelay' */
  boolean_T BetaRelay;                 /* '<S188>/BetaRelay' */
  boolean_T NOT_g;                     /* '<S196>/NOT' */
  boolean_T Compare_f;                 /* '<S277>/Compare' */
  boolean_T Compare_g;                 /* '<S279>/Compare' */
  boolean_T Compare_j;                 /* '<S276>/Compare' */
  boolean_T LogicalOperator1;          /* '<S266>/Logical Operator1' */
  boolean_T Compare_n;                 /* '<S280>/Compare' */
  boolean_T LogicalOperator2;          /* '<S266>/Logical Operator2' */
  boolean_T AND;                       /* '<S266>/AND' */
  boolean_T UnitDelay_h;               /* '<S266>/Unit Delay' */
  boolean_T Switch_ls;                 /* '<S266>/Switch' */
  boolean_T Compare_i;                 /* '<S278>/Compare' */
  boolean_T LogicalOperator_eh;        /* '<S266>/Logical Operator' */
  boolean_T DataStoreRead1_c;          /* '<S168>/Data Store Read1' */
  boolean_T LogicalOperator_ed;        /* '<S168>/Logical Operator' */
  boolean_T DataStoreRead1_i;          /* '<S169>/Data Store Read1' */
  boolean_T LogicalOperator_i;         /* '<S169>/Logical Operator' */
  boolean_T AlphaRelay_p;              /* '<S338>/AlphaRelay' */
  boolean_T BetaRelay_j;               /* '<S338>/BetaRelay' */
  boolean_T RelationalOperator_l;      /* '<S25>/Relational Operator' */
  boolean_T Compare_n2;                /* '<S31>/Compare' */
  boolean_T Compare_m;                 /* '<S32>/Compare' */
  boolean_T LowerRelop1;               /* '<S36>/LowerRelop1' */
  boolean_T RelationalOperator_c;      /* '<S35>/Relational Operator' */
  boolean_T UpperRelop;                /* '<S36>/UpperRelop' */
  rtB_SpeedControl_iPMSM_F28069M SpeedControl;/* '<Root>/Speed Control' */
  rtB_SPIMasterTransfer_iPMSM_F28 SPIMasterTransfer1;/* '<S377>/SPI Master Transfer' */
  rtB_SPIMasterTransfer_iPMSM_F28 SPIMasterTransfer;/* '<S377>/SPI Master Transfer' */
  rtB_IfActionSubsystem1_iPMSM_F2 IfActionSubsystem1_j;/* '<S253>/If Action Subsystem1' */
  rtB_IfActionSubsystem_iPMSM_F28 IfActionSubsystem_e;/* '<S253>/If Action Subsystem' */
  rtB_Accumulate_iPMSM_F28069M Accumulate_j;/* '<S196>/Accumulate' */
  rtB_Dir_Sense_iPMSM_F28069M Dir_Sense_m;/* '<S188>/Dir_Sense' */
  rtB_Dir_Sense_iPMSM_F28069M Dir_Sense;/* '<S338>/Dir_Sense' */
  rtB_IfActionSubsystem1_iPMSM_F2 IfActionSubsystem1;/* '<S147>/If Action Subsystem1' */
  rtB_IfActionSubsystem_iPMSM_F28 IfActionSubsystem;/* '<S147>/If Action Subsystem' */
  rtB_Accumulate_iPMSM_F28069M Accumulate;/* '<S142>/Accumulate' */
} BlockIO_iPMSM_F28069M;

