WillianWang2023/PMSM_Control/2_Simulink/work/iPMSM_F28069M_ert_rtw/iPMSM_F28069M.h
/* Block states (default storage) for system '<Root>' */
typedef struct {
  real32_T UnitDelay_DSTATE;           /* '<S142>/Unit Delay' */
  real32_T Delay5_DSTATE[4];           /* '<S1>/Delay5' */
  real32_T UnitDelay_DSTATE_l;         /* '<S24>/Unit Delay' */
  real32_T Integrator_DSTATE;          /* '<S124>/Integrator' */
  real32_T UnitDelay_DSTATE_l0;        /* '<S23>/Unit Delay' */
  real32_T Integrator_DSTATE_j;        /* '<S73>/Integrator' */
  real32_T Delay1_DSTATE;              /* '<S170>/Delay1' */
  real32_T Delay_DSTATE[2];            /* '<S171>/Delay' */
  real32_T Delay_DSTATE_i;             /* '<S189>/Delay' */
  real32_T Integrator_DSTATE_o;        /* '<S233>/Integrator' */
  real32_T Delay2_DSTATE;              /* '<S294>/Delay2' */
  real32_T Delay3_DSTATE;              /* '<S294>/Delay3' */
  real32_T Delay2_DSTATE_i;            /* '<S295>/Delay2' */
  real32_T Delay3_DSTATE_a;            /* '<S295>/Delay3' */
  real32_T Delay1_DSTATE_j;            /* '<S286>/Delay1' */
  real32_T Delay_DSTATE_a;             /* '<S286>/Delay' */
  real32_T Delay1_DSTATE_a;            /* '<S287>/Delay1' */
  real32_T Delay_DSTATE_o;             /* '<S287>/Delay' */
  real32_T Delay2_DSTATE_o;            /* '<S261>/Delay2' */
  real32_T Delay3_DSTATE_f;            /* '<S261>/Delay3' */
  real32_T Delay2_DSTATE_p;            /* '<S262>/Delay2' */
  real32_T Delay3_DSTATE_n;            /* '<S262>/Delay3' */
  real32_T UnitDelay_DSTATE_n3[4];     /* '<S311>/Unit Delay' */
  real32_T Delay1_DSTATE_n;            /* '<S327>/Delay1' */
  real32_T Delay_DSTATE_om;            /* '<S327>/Delay' */
  real32_T UnitDelay_DSTATE_p;         /* '<S331>/Unit Delay' */
  real32_T Delay1_DSTATE_n2;           /* '<S320>/Delay1' */
  real32_T Delay_DSTATE_hc;            /* '<S320>/Delay' */
  real32_T UnitDelay_DSTATE_nr;        /* '<S324>/Unit Delay' */
  real32_T UnitDelay_DSTATE_a1;        /* '<S334>/Unit Delay' */
  real32_T Delay_DSTATE_n;             /* '<S339>/Delay' */
  real32_T Delay1_DSTATE_l;            /* '<S349>/Delay1' */
  real32_T Delay_DSTATE_e;             /* '<S340>/Delay' */
  real32_T Delay1_DSTATE_jt;           /* '<S350>/Delay1' */
  real32_T Delay_DSTATE_nm;            /* '<S337>/Delay' */
  uint32_T Delay_DSTATE_ad[10];        /* '<S307>/Delay' */
  volatile real32_T RT6_Buffer[2];     /* '<Root>/RT6' */
  volatile real32_T RT4_Buffer[2];     /* '<Root>/RT4' */
  volatile real32_T RT2_Buffer[4];     /* '<Root>/RT2' */
  real32_T Speed_ref;                  /* '<Root>/Data Store Memory3' */
  int32_T DigitalOutput1_FRAC_LEN;     /* '<S386>/Digital Output1' */
  int32_T DigitalOutput_FRAC_LEN;      /* '<S377>/Digital Output' */
  int32_T Add_DWORK1[2];               /* '<S165>/Add' */
  int32_T DigitalOutput_FRAC_LEN_h;    /* '<S364>/Digital Output' */
  int32_T SpeedCount_DWORK1;           /* '<S307>/SpeedCount' */
  uint32_T Sum_DWORK1[4];              /* '<S20>/Sum' */
  uint16_T Output_DSTATE;              /* '<S157>/Output' */
  volatile int16_T RT6_ActiveBufIdx;   /* '<Root>/RT6' */
  volatile int16_T RT6_semaphoreTaken; /* '<Root>/RT6' */
  volatile int16_T RT4_ActiveBufIdx;   /* '<Root>/RT4' */
  volatile int16_T RT4_semaphoreTaken; /* '<Root>/RT4' */
  volatile int16_T RT2_ActiveBufIdx;   /* '<Root>/RT2' */
  uint16_T IaOffset;                   /* '<Root>/Data Store Memory1' */
  uint16_T IbOffset;                   /* '<Root>/Data Store Memory2' */
  uint16_T Memory_PreviousInput;       /* '<S384>/Memory' */
  uint16_T Memory1_PreviousInput;      /* '<S384>/Memory1' */
  uint16_T Add_DWORK1_o;               /* '<S366>/Add' */
  uint16_T CircBufIdx;                 /* '<S307>/Delay' */
  uint16_T CircBufIdx_n;               /* '<S344>/Delay' */
  int16_T Integrator_PrevResetState;   /* '<S124>/Integrator' */
  int16_T Integrator_PrevResetState_f; /* '<S73>/Integrator' */
  int16_T Integrator_PrevResetState_e; /* '<S233>/Integrator' */
  uint16_T Integrator_IC_LOADING;      /* '<S124>/Integrator' */
  uint16_T Integrator_IC_LOADING_p;    /* '<S73>/Integrator' */
  boolean_T Enable;                    /* '<Root>/Data Store Memory29' */
  boolean_T EnClosedLoop;              /* '<Root>/Data Store Memory5' */
  boolean_T AlphaRelay_Mode;           /* '<S188>/AlphaRelay' */
  boolean_T BetaRelay_Mode;            /* '<S188>/BetaRelay' */
  boolean_T AlphaRelay_Mode_c;         /* '<S338>/AlphaRelay' */
  boolean_T BetaRelay_Mode_j;          /* '<S338>/BetaRelay' */
  rtDW_SpeedControl_iPMSM_F28069M SpeedControl;/* '<Root>/Speed Control' */
  rtDW_SPIMasterTransfer_iPMSM_F2 SPIMasterTransfer1;/* '<S377>/SPI Master Transfer' */
  rtDW_SPIMasterTransfer_iPMSM_F2 SPIMasterTransfer;/* '<S377>/SPI Master Transfer' */
  rtDW_Accumulate_iPMSM_F28069M Accumulate_j;/* '<S196>/Accumulate' */
  rtDW_Accumulate_iPMSM_F28069M Accumulate;/* '<S142>/Accumulate' */
} D_Work_iPMSM_F28069M;

/* Zero-crossing (trigger) state */
typedef struct {
  ZCSigState Delay1_Reset_ZCE;         /* '<S170>/Delay1' */
  ZCSigState Delay_Reset_ZCE;          /* '<S171>/Delay' */
  ZCSigState Delay_Reset_ZCE_b;        /* '<S189>/Delay' */
  ZCSigState Delay2_Reset_ZCE;         /* '<S294>/Delay2' */
  ZCSigState Delay3_Reset_ZCE;         /* '<S294>/Delay3' */
  ZCSigState Delay2_Reset_ZCE_a;       /* '<S295>/Delay2' */
  ZCSigState Delay3_Reset_ZCE_e;       /* '<S295>/Delay3' */
  ZCSigState Delay1_Reset_ZCE_h;       /* '<S286>/Delay1' */
  ZCSigState Delay_Reset_ZCE_d;        /* '<S286>/Delay' */
  ZCSigState Delay1_Reset_ZCE_j;       /* '<S287>/Delay1' */
  ZCSigState Delay_Reset_ZCE_bz;       /* '<S287>/Delay' */
  ZCSigState Delay2_Reset_ZCE_e;       /* '<S261>/Delay2' */
  ZCSigState Delay3_Reset_ZCE_d;       /* '<S261>/Delay3' */
  ZCSigState Delay2_Reset_ZCE_c;       /* '<S262>/Delay2' */
  ZCSigState Delay3_Reset_ZCE_p;       /* '<S262>/Delay3' */
  rtZCE_Dir_Sense_iPMSM_F28069M Dir_Sense_m;/* '<S188>/Dir_Sense' */
  ZCSigState Delay1_Reset_ZCE_p;       /* '<S327>/Delay1' */
  ZCSigState Delay_Reset_ZCE_a;        /* '<S327>/Delay' */
  ZCSigState Delay1_Reset_ZCE_a;       /* '<S320>/Delay1' */
  ZCSigState Delay_Reset_ZCE_o;        /* '<S320>/Delay' */
  ZCSigState Delay_Reset_ZCE_n;        /* '<S339>/Delay' */
  ZCSigState Delay1_Reset_ZCE_b;       /* '<S349>/Delay1' */
  ZCSigState Delay_Reset_ZCE_l;        /* '<S340>/Delay' */
  ZCSigState Delay1_Reset_ZCE_bl;      /* '<S350>/Delay1' */
  ZCSigState Delay_Reset_ZCE_n0;       /* '<S337>/Delay' */
  rtZCE_Dir_Sense_iPMSM_F28069M Dir_Sense;/* '<S338>/Dir_Sense' */
} PrevZCSigStates_iPMSM_F28069M;

/* Invariant block signals (default storage) */
typedef struct {
  const uint16_T Width;                /* '<S9>/Width' */
} ConstBlockIO_iPMSM_F28069M;

/* Constant parameters (default storage) */
typedef struct {
  /* Pooled Parameter (Expression: )
   * Referenced by:
   *   '<S20>/sine_table_values'
   *   '<S197>/sine_table_values'
   */
  real32_T pooled32[1002];
} ConstParam_iPMSM_F28069M;

/* Real-time Model Data Structure */
struct tag_RTM_iPMSM_F28069M {
  const char_T * volatile errorStatus;

