WillianWang2023/PMSM_Control/2_Simulink/work/iPMSM_F28069M_ert_rtw/iPMSM_F28069M.h
  /*
   * Timing:
   * The following substructure contains information regarding
   * the timing information for the model.
   */
  struct {
    struct {
      uint16_T TID[2];
    } TaskCounters;
  } Timing;
};

/* Block signals (default storage) */
extern BlockIO_iPMSM_F28069M iPMSM_F28069M_B;

/* Block states (default storage) */
extern D_Work_iPMSM_F28069M iPMSM_F28069M_DWork;

/* Zero-crossing (trigger) state */
extern PrevZCSigStates_iPMSM_F28069M iPMSM_F28069M_PrevZCSigState;
extern const ConstBlockIO_iPMSM_F28069M iPMSM_F28069M_ConstB;/* constant block i/o */

/* Constant parameters (default storage) */
extern const ConstParam_iPMSM_F28069M iPMSM_F28069M_ConstP;

/*
 * Exported Global Signals
 *
 * Note: Exported global signals are block signals with an exported global
 * storage class designation.  Code generation will declare the memory for
 * these signals and export their symbols.
 *
 */
extern real32_T Iab_fb_PU[2];          /* '<S165>/Data Type Conversion1' */
extern uint16_T Iab_ADC_u16[2];        /* '<S164>/IA//IB Measurement' */

/* External function called from main */
extern void iPMSM_F28069M_SetEventsForThisBaseStep(boolean_T *eventFlags);

/* Model entry point functions */
extern void iPMSM_F28069M_initialize(void);
extern void iPMSM_F28069M_step0(void);
extern void iPMSM_F28069M_step1(void);
extern void iPMSM_F28069M_terminate(void);

/* Real-time Model object */
extern RT_MODEL_iPMSM_F28069M *const iPMSM_F28069M_M;
extern volatile boolean_T stopRequested;
extern volatile boolean_T runModel;

#ifdef __cpluscplus

extern "C"
{

#endif

  interrupt void ADCINT1(void);
  interrupt void SCIRXINTA(void);
  void iPMSM_F28069M_configure_interrupts (void);
  void iPMSM_F28069M_unconfigure_interrupts (void);

#ifdef __cpluscplus

}

#endif

/*-
 * The generated code includes comments that allow you to trace directly
 * back to the appropriate location in the model.  The basic format
 * is <system>/block_name, where system is the system number (uniquely
 * assigned by Simulink) and block_name is the name of the block.
 *
 * Use the MATLAB hilite_system command to trace the generated code back
 * to the model.  For example,
 *
 * hilite_system('<S3>')    - opens system 3
 * hilite_system('<S3>/Kp') - opens and selects block Kp which resides in S3
 *
 * Here is the system hierarchy for this model
 *
 * '<Root>' : 'iPMSM_F28069M'
 * '<S1>'   : 'iPMSM_F28069M/Current Control'
 * '<S2>'   : 'iPMSM_F28069M/HW Interrrupt'
 * '<S3>'   : 'iPMSM_F28069M/Hardware Init'
 * '<S4>'   : 'iPMSM_F28069M/Heartbeat LED'
 * '<S5>'   : 'iPMSM_F28069M/Inverter and Motor - Plant Model'
 * '<S6>'   : 'iPMSM_F28069M/Serial Receive'
 * '<S7>'   : 'iPMSM_F28069M/Speed Control'
 * '<S8>'   : 'iPMSM_F28069M/Current Control/Closed Loop'
 * '<S9>'   : 'iPMSM_F28069M/Current Control/Data_Logging'
 * '<S10>'  : 'iPMSM_F28069M/Current Control/HW Inputs'
 * '<S11>'  : 'iPMSM_F28069M/Current Control/Input Scaling'
 * '<S12>'  : 'iPMSM_F28069M/Current Control/Inverter'
 * '<S13>'  : 'iPMSM_F28069M/Current Control/Output Scaling'
 * '<S14>'  : 'iPMSM_F28069M/Current Control/SCI_Tx'
 * '<S15>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Clarke Transform'
 * '<S16>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers'
 * '<S17>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Inverse Park Transform'
 * '<S18>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Open_Loop_Control'
 * '<S19>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Park Transform'
 * '<S20>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Sine-Cosine Lookup'
 * '<S21>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Space Vector Generator'
 * '<S22>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/DQ Limiter'
 * '<S23>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id'
 * '<S24>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq'
 * '<S25>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D-Q Equivalence'
 * '<S26>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority'
 * '<S27>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/DQ Limiter/Inport//Dialog Selection'
 * '<S28>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/DQ Limiter/Magnitude_calc'
 * '<S29>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D-Q Equivalence/Limiter'
 * '<S30>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D-Q Equivalence/Passthrough'
 * '<S31>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/Compare To Constant'
 * '<S32>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/Compare To Constant1'
 * '<S33>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/flipInputs'
 * '<S34>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/flipInputs1'
 * '<S35>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter'
 * '<S36>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/limitRef1'
 * '<S37>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/limitRef2'
 * '<S38>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/passThrough'
 * '<S39>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset'
 * '<S40>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S41>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S42>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S43>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S44>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S45>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S46>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S47>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S48>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S49>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S50>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S51>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S52>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S53>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S54>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S55>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S56>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S57>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S58>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S59>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S60>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S61>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S62>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S63>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S64>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S65>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S66>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S67>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S68>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S69>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S70>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S71>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S72>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S73>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S74>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S75>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S76>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S77>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S78>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S79>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S80>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S81>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S82>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S83>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S84>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S85>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S86>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S87>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S88>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S89>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S90>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset'
 * '<S91>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S92>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S93>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S94>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S95>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S96>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S97>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S98>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S99>'  : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S100>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S101>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S102>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S103>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S104>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S105>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S106>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S107>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S108>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S109>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S110>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S111>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S112>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S113>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S114>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S115>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S116>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S117>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S118>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S119>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S120>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S121>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S122>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S123>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S124>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S125>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S126>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S127>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S128>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S129>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S130>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S131>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S132>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S133>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S134>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S135>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S136>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S137>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S138>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S139>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S140>' : 'iPMSM_F28069M/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S141>' : 'iPMSM_F28069M/Current Control/Closed Loop/Inverse Park Transform/Switch_Axis'
 * '<S142>' : 'iPMSM_F28069M/Current Control/Closed Loop/Open_Loop_Control/Position Generator'
 * '<S143>' : 'iPMSM_F28069M/Current Control/Closed Loop/Open_Loop_Control/Position Generator/Accumulate'
 * '<S144>' : 'iPMSM_F28069M/Current Control/Closed Loop/Open_Loop_Control/Position Generator/Accumulate/Subsystem'
 * '<S145>' : 'iPMSM_F28069M/Current Control/Closed Loop/Park Transform/Switch_Axis'
 * '<S146>' : 'iPMSM_F28069M/Current Control/Closed Loop/Sine-Cosine Lookup/Interpolation'
 * '<S147>' : 'iPMSM_F28069M/Current Control/Closed Loop/Sine-Cosine Lookup/WrapUp'
 * '<S148>' : 'iPMSM_F28069M/Current Control/Closed Loop/Sine-Cosine Lookup/WrapUp/Compare To Zero'
 * '<S149>' : 'iPMSM_F28069M/Current Control/Closed Loop/Sine-Cosine Lookup/WrapUp/If Action Subsystem'
 * '<S150>' : 'iPMSM_F28069M/Current Control/Closed Loop/Sine-Cosine Lookup/WrapUp/If Action Subsystem1'
 * '<S151>' : 'iPMSM_F28069M/Current Control/Closed Loop/Space Vector Generator/Modulation method'
 * '<S152>' : 'iPMSM_F28069M/Current Control/Closed Loop/Space Vector Generator/Voltage Input'
 * '<S153>' : 'iPMSM_F28069M/Current Control/Closed Loop/Space Vector Generator/Modulation method/SVPWM'
 * '<S154>' : 'iPMSM_F28069M/Current Control/Closed Loop/Space Vector Generator/Modulation method/SVPWM/Half(Vmin+Vmax)'
 * '<S155>' : 'iPMSM_F28069M/Current Control/Closed Loop/Space Vector Generator/Voltage Input/Valphabeta'
 * '<S156>' : 'iPMSM_F28069M/Current Control/Closed Loop/Space Vector Generator/Voltage Input/Valphabeta/Inverse Clarke Transform'
 * '<S157>' : 'iPMSM_F28069M/Current Control/Data_Logging/Counter Limited'
