WillianWang2023/PMSM_Control/2_Simulink/work/iPMSM_F28069M_ert_rtw/iPMSM_F28069M.h
 * '<S292>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward1/IntegralMethod/IIR Filter3/IIR Filter/Low-pass'
 * '<S293>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward1/IntegralMethod/IIR Filter3/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S294>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward1/OptimizedDifferentiationMethod/Differentiator'
 * '<S295>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward1/OptimizedDifferentiationMethod/Differentiator1'
 * '<S296>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward1/OptimizedDifferentiationMethod/IIR Filter1'
 * '<S297>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward1/OptimizedDifferentiationMethod/IIR Filter3'
 * '<S298>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward1/OptimizedDifferentiationMethod/IIR Filter1/IIR Filter'
 * '<S299>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward1/OptimizedDifferentiationMethod/IIR Filter1/IIR Filter/Low-pass'
 * '<S300>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward1/OptimizedDifferentiationMethod/IIR Filter1/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S301>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward1/OptimizedDifferentiationMethod/IIR Filter3/IIR Filter'
 * '<S302>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward1/OptimizedDifferentiationMethod/IIR Filter3/IIR Filter/Low-pass'
 * '<S303>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward1/OptimizedDifferentiationMethod/IIR Filter3/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S304>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/DC component removal'
 * '<S305>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer'
 * '<S306>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/IIR Filter'
 * '<S307>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Speed Measurement'
 * '<S308>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/DC component removal/IIR Filter'
 * '<S309>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/DC component removal/IIR Filter/IIR Filter'
 * '<S310>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/DC component removal/IIR Filter/IIR Filter/Low-pass'
 * '<S311>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/DC component removal/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S312>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Atan2'
 * '<S313>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha'
 * '<S314>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta'
 * '<S315>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Atan2/Default'
 * '<S316>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Atan2/Default/atan2'
 * '<S317>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Atan2/Default/atan2/Per Unit'
 * '<S318>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default'
 * '<S319>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/IIR Filter'
 * '<S320>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/Integrator'
 * '<S321>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/Scaling'
 * '<S322>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/IIR Filter/IIR Filter'
 * '<S323>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/IIR Filter/IIR Filter/High-pass'
 * '<S324>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/IIR Filter/IIR Filter/High-pass/IIR Low Pass Filter'
 * '<S325>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default'
 * '<S326>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/IIR Filter'
 * '<S327>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/Integrator'
 * '<S328>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/Scaling'
 * '<S329>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/IIR Filter/IIR Filter'
 * '<S330>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/IIR Filter/IIR Filter/High-pass'
 * '<S331>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/IIR Filter/IIR Filter/High-pass/IIR Low Pass Filter'
 * '<S332>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/IIR Filter/IIR Filter'
 * '<S333>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/IIR Filter/IIR Filter/Low-pass'
 * '<S334>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S335>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Speed Measurement/DT_Handle'
 * '<S336>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Speed Measurement/DT_Handle/floating-point'
 * '<S337>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1'
 * '<S338>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Direction_Latch'
 * '<S339>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Ealpha_est'
 * '<S340>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Ebeta_est'
 * '<S341>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ealpha'
 * '<S342>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ebeta'
 * '<S343>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/IIR Filter'
 * '<S344>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Speed Measurement'
 * '<S345>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/angleCompensation'
 * '<S346>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Direction_Latch/Dir_Sense'
 * '<S347>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Direction_Latch/Subsystem2'
 * '<S348>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Direction_Latch/Subsystem3'
 * '<S349>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Ealpha_est/DisturbanceObserver'
 * '<S350>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Ebeta_est/DisturbanceObserver'
 * '<S351>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ealpha/IIR Filter'
 * '<S352>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ealpha/IIR Filter/Low-pass'
 * '<S353>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ealpha/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S354>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ebeta/IIR Filter'
 * '<S355>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ebeta/IIR Filter/Low-pass'
 * '<S356>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ebeta/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S357>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/IIR Filter/IIR Filter'
 * '<S358>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/IIR Filter/IIR Filter/Low-pass'
 * '<S359>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S360>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Speed Measurement/DT_Handle'
 * '<S361>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Speed Measurement/DT_Handle/floating-point'
 * '<S362>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/angleCompensation/atan1'
 * '<S363>' : 'iPMSM_F28069M/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/angleCompensation/atan1/Per Unit'
 * '<S364>' : 'iPMSM_F28069M/Current Control/Inverter/Code Generation'
 * '<S365>' : 'iPMSM_F28069M/Current Control/SCI_Tx/Code Generation'
 * '<S366>' : 'iPMSM_F28069M/Current Control/SCI_Tx/Code Generation/CodeGeneration'
 * '<S367>' : 'iPMSM_F28069M/HW Interrrupt/Code generation'
 * '<S368>' : 'iPMSM_F28069M/HW Interrrupt/Code generation/HWI_ADCINT1'
 * '<S369>' : 'iPMSM_F28069M/HW Interrrupt/Code generation/HWI_SCIRXINTA'
 * '<S370>' : 'iPMSM_F28069M/HW Interrrupt/Code generation/HWI_ADCINT1/ECSoC'
 * '<S371>' : 'iPMSM_F28069M/HW Interrrupt/Code generation/HWI_ADCINT1/ECSoC/ECSimCodegen'
 * '<S372>' : 'iPMSM_F28069M/HW Interrrupt/Code generation/HWI_SCIRXINTA/ECSoC'
 * '<S373>' : 'iPMSM_F28069M/HW Interrrupt/Code generation/HWI_SCIRXINTA/ECSoC/ECSimCodegen'
 * '<S374>' : 'iPMSM_F28069M/Hardware Init/Variant Subsystem'
 * '<S375>' : 'iPMSM_F28069M/Hardware Init/Variant Subsystem/Code Generation'
 * '<S376>' : 'iPMSM_F28069M/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset '
 * '<S377>' : 'iPMSM_F28069M/Hardware Init/Variant Subsystem/Code Generation/DRV Enable'
 * '<S378>' : 'iPMSM_F28069M/Hardware Init/Variant Subsystem/Code Generation/Default ADC Offset'
 * '<S379>' : 'iPMSM_F28069M/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /For Iterator Subsystem'
 * '<S380>' : 'iPMSM_F28069M/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /If Action Subsystem'
 * '<S381>' : 'iPMSM_F28069M/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /If Action Subsystem1'
 * '<S382>' : 'iPMSM_F28069M/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /If Action Subsystem2'
 * '<S383>' : 'iPMSM_F28069M/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /If Action Subsystem3'
 * '<S384>' : 'iPMSM_F28069M/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /For Iterator Subsystem/If Action Subsystem'
 * '<S385>' : 'iPMSM_F28069M/Heartbeat LED/Heartbeat LED'
 * '<S386>' : 'iPMSM_F28069M/Heartbeat LED/Heartbeat LED/Code generation'
 * '<S387>' : 'iPMSM_F28069M/Inverter and Motor - Plant Model/Codegeneration'
 * '<S388>' : 'iPMSM_F28069M/Serial Receive/Data_Conditioning'
 * '<S389>' : 'iPMSM_F28069M/Serial Receive/SCI_Rx'
 * '<S390>' : 'iPMSM_F28069M/Serial Receive/SCI_Rx/Code Generation'
 * '<S391>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed'
 * '<S392>' : 'iPMSM_F28069M/Speed Control/SlewRate'
 * '<S393>' : 'iPMSM_F28069M/Speed Control/Speed_Ref_Selector'
 * '<S394>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset'
 * '<S395>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Zero_Cancellation'
 * '<S396>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S397>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S398>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S399>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S400>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S401>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S402>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S403>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S404>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S405>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S406>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S407>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S408>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S409>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S410>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S411>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S412>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S413>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S414>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S415>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S416>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S417>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S418>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S419>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S420>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S421>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S422>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S423>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S424>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S425>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S426>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S427>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S428>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S429>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S430>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S431>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S432>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S433>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S434>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S435>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S436>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S437>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S438>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S439>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S440>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S441>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S442>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S443>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S444>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S445>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S446>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter'
 * '<S447>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter/Low-pass'
 * '<S448>' : 'iPMSM_F28069M/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter/Low-pass/IIR Low Pass Filter'
 */
#endif                                 /* RTW_HEADER_iPMSM_F28069M_h_ */

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
